Tekla Open API Reference for Tekla Structures 2025
GridLine.Attributes Property
 The attributes of the grid line. For more information see GridLine.GridLineAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridLine.GridLineAttributes Attributes { get; set; }
Public Property Attributes As GridLine.GridLineAttributes
	Get
	Set
Property Value
Type: GridLine.GridLineAttributes
See Also
Reference
GridLine Class
Tekla.Structures.Drawing Namespace